#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.storage_bucket["bucket_0"].google_kms_crypto_key.terraform_state_bucket will be created
+   resource "google_kms_crypto_key" "terraform_state_bucket" {
+       destroy_scheduled_duration = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       import_only                = (known after apply)
+       key_ring                   = (known after apply)
+       name                       = "terraform-state-key"
+       primary                    = (known after apply)
+       purpose                    = "ENCRYPT_DECRYPT"
+       rotation_period            = "86400s"
+       terraform_labels           = (known after apply)
    }

  # module.storage_bucket["bucket_0"].google_kms_key_ring.terraform_state will be created
+   resource "google_kms_key_ring" "terraform_state" {
+       id       = (known after apply)
+       location = "EUROPE-SOUTHWEST1"
+       name     = "terraform-state-bucket-tfstate"
+       project  = "my-project-id"
    }

  # module.storage_bucket["bucket_0"].google_storage_bucket.terraform_state will be created
+   resource "google_storage_bucket" "terraform_state" {
+       effective_labels            = {
+           "environment"   = "prod"
+           "managing_tool" = "terraform"
+           "project_name"  = "terraform-state-bucket"
        }
+       force_destroy               = false
+       id                          = (known after apply)
+       labels                      = {
+           "environment"   = "prod"
+           "managing_tool" = "terraform"
+           "project_name"  = "terraform-state-bucket"
        }
+       location                    = "EUROPE-SOUTHWEST1"
+       name                        = "terraform-state-prod-bucket-tfstate"
+       project                     = (known after apply)
+       public_access_prevention    = (known after apply)
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = {
+           "environment"   = "prod"
+           "managing_tool" = "terraform"
+           "project_name"  = "terraform-state-bucket"
        }
+       uniform_bucket_level_access = (known after apply)
+       url                         = (known after apply)

+       encryption {
+           default_kms_key_name = (known after apply)
        }

+       versioning {
+           enabled = true
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @PRubioDev, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request Main`*